name: "bert_ensemble"
platform: "ensemble"
max_batch_size: 32

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

output [
  {
    name: "EMBEDDINGS"
    data_type: TYPE_FP32
    dims: [768 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "bert_tokenizer"
      model_version: -1
      input_map {
        key: "TEXT"
        value: "TEXT"
      }
      output_map {
        key: "INPUT_IDS"
        value: "input_ids"
      }
      output_map {
        key: "ATTENTION_MASK"
        value: "attention_mask"
      }
      output_map {
        key: "TOKEN_TYPE_IDS"
        value: "token_type_ids"
      }
    },
    {
      model_name: "bert_model"
      model_version: -1
      input_map {
        key: "input_ids"
        value: "input_ids"
      }
      input_map {
        key: "attention_mask"
        value: "attention_mask"
      }
      input_map {
        key: "token_type_ids"
        value: "token_type_ids"
      }
      output_map {
        key: "cls_output"
        value: "EMBEDDINGS"
      }
    }
  ]
}