name: "bert_model"
platform: "onnxruntime_onnx"
max_batch_size: 32

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [-1]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [-1]
  },
  {
    name: "token_type_ids"
    data_type: TYPE_INT64
    dims: [-1]
  }
]

output [
  {
    name: "cls_output"
    data_type: TYPE_FP32
    dims: [768]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]