name: "bert_tokenizer"
backend: "python"
max_batch_size: 32

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

output [
  {
    name: "INPUT_IDS"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "ATTENTION_MASK"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "TOKEN_TYPE_IDS"
    data_type: TYPE_INT64
    dims: [ -1]
  }
]